# Aaj hum dataset ko jany gen

In [3]:
# step 1
# load necessary libraries
import pandas as pd

In [5]:
#pip install pandas

# step 2: load dataset

In [6]:
# load dataset '
# step 2
# load the dataset
data = pd.read_csv('births.csv')

In [7]:
# step 3
# check the shape of the dataset    
data.shape

(15547, 5)

In [8]:
data.shape[0]

15547

In [9]:
data.shape[1]

5

In [10]:
# step 4
# check the head of the dataset
data.head()

   year  month  day gender  births
0  1969      1  1.0      F    4046
1  1969      1  1.0      M    4440
2  1969      1  2.0      F    4454
3  1969      1  2.0      M    4548
4  1969      1  3.0      F    4548

In [11]:
data.head(20)

    year  month   day gender  births
0   1969      1   1.0      F    4046
1   1969      1   1.0      M    4440
2   1969      1   2.0      F    4454
3   1969      1   2.0      M    4548
4   1969      1   3.0      F    4548
5   1969      1   3.0      M    4994
6   1969      1   4.0      F    4440
7   1969      1   4.0      M    4520
8   1969      1   5.0      F    4192
9   1969      1   5.0      M    4198
10  1969      1   6.0      F    4710
11  1969      1   6.0      M    4850
12  1969      1   7.0      F    4646
13  1969      1   7.0      M    5092
14  1969      1   8.0      F    4800
15  1969      1   8.0      M    4934
16  1969      1   9.0      F    4592
17  1969      1   9.0      M    4842
18  1969      1  10.0      F    4852
19  1969      1  10.0      M    5190

In [12]:
# step 5
# check the tail of the dataset
data.tail()

       year  month  day gender  births
15542  2008     10  NaN      M  183219
15543  2008     11  NaN      F  158939
15544  2008     11  NaN      M  165468
15545  2008     12  NaN      F  173215
15546  2008     12  NaN      M  181235

In [13]:
# step 6
# check the columns of the dataset  
data.columns

Index(['year', 'month', 'day', 'gender', 'births'], dtype='object')

In [14]:
data.index

RangeIndex(start=0, stop=15547, step=1)

In [15]:
# step 7
# check the data types of the dataset   
data.dtypes

year        int64
month       int64
day       float64
gender     object
births      int64
dtype: object

In [16]:
# step 8
# check the info of the dataset
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15547 entries, 0 to 15546
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   year    15547 non-null  int64
 1   month   15547 non-null  int64
 2   day     15067 non-null  float64
 3   gender  15547 non-null  object
 4   births  15547 non-null  int64
dtypes: float64(1), int64(3), object(1)
memory usage: 607.4+ KB

In [17]:
# step 9
# check the summary of the dataset
data.describe()

               year         month           day         births
count  15547.000000  15547.000000  15067.000000   15547.000000
mean    1979.037435      6.515919     17.769894    9762.293561
std        6.728340      3.449632     15.284034   28552.465810
min     1969.000000      1.000000      1.000000       1.000000
25%     1974.000000      4.000000      8.000000    4358.000000
50%     1979.000000      7.000000     16.000000    4814.000000
75%     1984.000000     10.000000     24.000000    5289.500000
max     2008.000000     12.000000     99.000000  199622.000000

In [18]:
data['year'].describe()

count    15547.000000
mean      1979.037435
std          6.728340
min       1969.000000
25%       1974.000000
50%       1979.000000
75%       1984.000000
max       2008.000000
Name: year, dtype: float64

In [19]:
data['year']

0        1969
1        1969
2        1969
3        1969
4        1969
         ...
15542    2008
15543    2008
15544    2008
15545    2008
15546    2008
Name: year, Length: 15547, dtype: int64

In [20]:
# step 10
# check unique values in the dataset
data['month'].unique()

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12])

In [21]:
data['day'].unique()

array([ 1.,  2.,  3.,  4.,  5.,  6.,  7.,  8.,  9., 10., 11., 12., 13.,
       14., 15., 16., 17., 18., 19., 20., 21., 22., 23., 24., 25., 26.,
       27., 28., 29., 30., 31., 99., nan])

In [22]:
data['year'].unique()

array([1969, 1970, 1971, 1972, 1973, 1974, 1975, 1976, 1977, 1978, 1979,
       1980, 1981, 1982, 1983, 1984, 1985, 1986, 1987, 1988, 1989, 1990,
       1991, 1992, 1993, 1994, 1995, 1996, 1997, 1998, 1999, 2000, 2001,
       2002, 2003, 2004, 2005, 2006, 2007, 2008])

In [23]:
# check year count
data['year'].value_counts()

year
1969    768
1970    768
1974    766
1972    765
1971    764
1975    763
1973    762
1976    761
1977    761
1978    761
1983    749
1982    748
1980    747
1979    747
1984    747
1981    745
1988    739
1985    737
1986    736
1987    733
1989     24
1990     24
1991     24
1992     24
1993     24
1994     24
1995     24
1996     24
1997     24
1998     24
1999     24
2000     24
2001     24
2002     24
2003     24
2004     24
2005     24
2006     24
2007     24
2008     24
Name: count, dtype: int64